cdm570L = {
    "device": "Satellite modem",
    "model": "CDM 570L",
    "mibs": [
        {
            "mib": "1.3.6.1.4.1.6247.24.1.3.1.1",
            "name": "Состояние блока",
            "value_type": "error",
            "codes": {
                "0": "аварий нет",
                "1": "авария блока питания +5 В",
                "2": "авария блока питания +12 В",
                "3": "авария блока питания -5 В",
                "4": "авария блока питания +23 В",
                "5": "авария блока питания -12 В",
                "6": "авария захвата синтезатора передачи",
                "7": "авария первого гетеродина приема",
                "8": "авария второго гетеродина приема",
                "9": "авария схемы ФАПЧ опорного генератора",
                "A": "значения на развитие",
                "B": "значения на развитие",
                "C": "значения на развитие",
                "D": "значения на развитие",
                "E": "авария IP-модуля",
                "F": "ошибка проверки суммы ПЗУ"
            }
        },
        {
            "mib": "1.3.6.1.4.1.6247.24.1.3.1.2",
            "name": "Состояние тракта передачи",
            "value_type": "error",
            "codes": {
                "0": "аварий нет",
                "1": "отсутствует тактовая частота от наземного оборудования",
                "2": "значения на развитие",
                "3": "проскальзывание бефера FIFO",
                "4": "значения на развитие",
                "5": "отсутствие внешней опорной частоты",
                "6": "значения на развитие",
                "7": "превышение верхнего предела режим AUPC",
                "8": "значения на развитие",
                "9": "AIS на передачу",
                "A": "значения на развитие",
                "B": "нарушение биполярной структуры сигнального интерфейса G.703",
                "C": "значения на развитие",
                "D": "значения на развитие",
                "E": "значения на развитие",
                "F": "значения на развитие"
            }
        },
        {
            "mib": "1.3.6.1.4.1.6247.24.1.3.1.3",
            "name": "Состояние тракта приема",
            "value_type": "error",
            "codes": {
                "0": "аварий нет",
                "1": "демодулятор не захвачен",
                "2": "значения на развитие",
                "3": "авария схемы АРУ",
                "4": "значения на развитие",
                "5": "авария схемы кадровой синхронизации декодера Рида-Соломона",
                "6": "значения на развитие",
                "7": "авария схемы кадровой синхронизации режима EDMAC",
                "8": "значения на развитие",
                "9": "значения на развитие",
                "A": "переполнение буфера",
                "B": "обнуление буфера",
                "C": "значения на развитие",
                "D": "авария по отношению Eb/N0",
                "E": "значения на развитие",
                "F": "AIS на приеме;"
            }
        },
        {
            "mib": "1.3.6.1.4.1.6247.24.1.3.1.4",
            "name": "Состояние блока наружного исполнения",
            "value_type": "error",
            "codes": {
                "0": "аварий блоков наружного использования нет",
                "1": "авария схемы ФАПЧ блока BUС",
                "2": "значения на развитие",
                "3": "авария блока BUC по току",
                "4": "значения на развитие",
                "5": "авария блока BUC по напряжению",
                "6": "значения на развитие",
                "7": "авария блока LNB по ток",
                "8": "значения на развитие",
                "9": "авария блока LNB по напряжению",
                "A": "значения на развитие",
                "B": "авария блока BUC по температуре",
                "C": "значения на развитие",
                "D": "ошибка проверки суммы блока BUC",
                "E": "значения на развитие",
                "F": "значения на развитие"
            }
        },
        {
            "mib": "1.3.6.1.4.1.6247.24.1.1.1.2",
            "name": "Температура",
            "value_type": "value",
        },
        {
            "mib": "1.3.6.1.4.1.6247.24.1.1.2.4",
            "name": "Тип модуляции",
            "value_type": "value",
        }
    ],
}
